#+title:   Bits
#+startup: content

*Warning:* Bits supports creators who produce content some may consider explicit
or not suitable for work. You may encounter such content in our product research
and competitor analysis. This repo itself does not contain any sexually explicit
content.

Platforms control your audience. Payment processors control your revenue. Bits
gives you both back.

*What you get:*

- Subscriptions, one-time purchases, digital downloads
- Video hosting and delivery
- Your data, your domain, your rules
- Permissive content policies for persecuted creators

*Why it works:*

- Self-host on a $5/month VPS or use managed hosting
- Single binary deployment - no complex setup
- Built with care to minimize resource usage and maximize reliability
- Open source - audit the code, modify what you need, contribute back

*The model:* Like WordPress.org - free to self-host, managed option available.
You're never locked in.

*Current state:* Active development. Your funding accelerates delivery.

* Development
Start required services and spawn a Tailwind watcher via =devenv=:

#+begin_src sh :eval never
devenv up
#+end_src

Then one can start an hot-reloading development process via Dioxus like so:

#+begin_src sh :eval never
just serve
#+end_src

** HTTPS and =*.test= URLs
*** Setup
To get our =*.test= URLs to work takes some effort with DNS.

#+begin_src sh :results output table :colnames '("Host" "Address")
drill bits.test | awk '/^bits/ { print $1 "\t" $5 }'
#+end_src

#+results:
| Host       |   Address |
|------------+-----------|
| bits.test. | 127.0.0.1 |

#+begin_src sh :results output verbatim
cat /etc/resolver/test
#+end_src

#+results:
: nameserver 10.10.10.254

*** Test
#+begin_src sh :results output verbatim :shebang "#!/usr/bin/env zsh" :exports results
urls=(
  https://www.usebits.app.test
  https://bits.page.test
  https://jcf.bits.page.test
)

for url in $urls; do
  http_code="$(curl --silent --output /dev/null --write-out "%{http_code}" "$url")"
  if [ "$http_code" -eq 200 ]; then
    echo "✅ $url"
  else
    echo "❌ $url ($http_code)"
  fi
done
#+end_src

#+results:
: ✅ https://www.usebits.app.test
: ✅ https://bits.page.test
: ✅ https://jcf.bits.page.test

And with a non-existent tenant, we expect a 404 response:

#+begin_src sh :results output verbatim :exports results
url="https://foo.bits.page.test"
http_code="$(curl --silent --output /dev/null --write-out "%{http_code}" "$url")"

if [ "$http_code" -eq 404 ]; then
  echo "✅ $url"
else
  echo "❌ $url ($http_code)"
fi
#+end_src

#+results:
: ✅ https://foo.bits.page.test

** Dev tasks
#+begin_src sh :results output verbatim :exports results
just --list
#+end_src

#+results:
#+begin_example
Available recipes:
    [build]
    build                           # Build fullstack web packages
    clean                           # Clear build caches
    release                         # Bundle a release build via dioxus-cli

    [db]
    db-migrate                      # Run database migrations
    db-migration name               # Create a new migration
    db-reset                        # Reset all development PostgreSQL state
    db-seed                         # Seed the database with test data
    psql *args                      # Start an interactive psql session connected to the local development database

    [deploy]
    nixos-build                     # Build Rust binary with Nix
    nixos-deploy                    # Deploy NixOS snapshot to production (blue/green deployment)
    nixos-rollback snapshot_name    # Rollback to previous NixOS snapshot
    nixos-snapshot                  # Build NixOS snapshot with baked-in application

    [docs]
    decide +title                   # Create a new decision record
    execute *args                   # Execute a prompt in a new Claude Code session
    prompt +title                   # Create a new prompt

    [infra]
    apply dir                       # Apply one or all Terraform projects
    import dir *args                # Import into a Terraform project
    init dir *args                  # Initialize one or all Terraform projects
    output dir *args                # Interact with outputs one or all Terraform projects
    plan dir                        # Plan one or all Terraform projects
    snapshot-build snapshot_name="" # Build NixOS image snapshot from flake
    snapshot-delete name            # Delete NixOS image snapshot
    snapshot-list                   # List NixOS image snapshots

    [quality]
    check                           # Run checks
    fix                             # Fix errors within Bits
    fmt                             # Format project files
    lint                            # Run lints

    [secrets]
    secret-decrypt file             # Decrypt a secret
    secret-edit file                # Edit a secret file
    secret-encrypt path             # Encrypt stdin to a file
    secret-rekey                    # Rekey all secrets with recipients in secrets/secrets.nix

    [serve]
    colo                            # Run Dioxus in co-located mode
    dev                             # Run Dioxus in co-located mode
    solo                            # Run Dioxus in solo mode
    tailwind dir                    # Watch source code for Tailwind classes
    www                             # Run the marketing site

    [setup]
    hetzner-contexts                # Upsert Bits contexts
    mkcert                          # Create self-signed SSL certificates via mkcert
    setup                           # Setup a local development environment

    [test]
    integrate                       # Run integration tests
    test                            # Run unit and integration tests
    unit                            # Run units tests

    [workflows]
    push                            # Verify and push changes
#+end_example

** SLOC
#+begin_src sh :results output verbatim :exports results
tokei
echo
echo "$(git describe --always --dirty --abbrev=7) @ $(date +"%Y/%m/%d %H:%M")"
#+end_src

#+results:
#+begin_example
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
 Language              Files        Lines         Code     Comments       Blanks
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
 Astro                    10          165          139            0           26
 Clojure                   2          559          456           32           71
 CSS                       3           42           38            0            4
 Edn                       4           47           47            0            0
 FreeMarker                1          107           92            0           15
 HCL                      40         1193          912          116          165
 HTML                      2           22           22            0            0
 JavaScript                2           51           43            1            7
 JSON                      4           58           58            0            0
 Just                      2          593          357          121          115
 MDX                       1           56            0           39           17
 Nix                       9         1167          760          230          177
 Org                      16         2620         2314            4          302
 SQL                       9          321          261           26           34
 TOML                     15          418          363            2           53
 TypeScript                3           36           30            1            5
 YAML                      3         5046         3963            0         1083
─────────────────────────────────────────────────────────────────────────────────
 Markdown                  1          176            0          116           60
 |- Rust                   1          200          141           34           25
 (Total)                              376          141          150           85
─────────────────────────────────────────────────────────────────────────────────
 Rust                     94        15968        13235          879         1854
 |- Markdown              37          405            4          345           56
 (Total)                            16373        13239         1224         1910
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━
 Total                   221        29250        23235         1946         4069
━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━

1039b0f-dirty @ 2025/12/08 21:32
#+end_example

* Decision records
#+begin_src sh :results output raw :exports output :exports results
fd --type file '\.org$' decisions | while read -r file; do
  title=$(awk -F':[[:space:]]*' 'NR==1 { print $2 }' "$file")
  echo "- [[file:$file][$title]]"
done
#+end_src

#+results:
- [[file:decisions/20251009133634-get-the-message-out.org][Get the message out]]
- [[file:decisions/20251009144920-python-style-environment-variables.org][Python-style environment variables]]
- [[file:decisions/20251118100535-mission-over-saas-startup-playbook.org][Mission over SaaS startup playbook]]
- [[file:decisions/20251119230950-ci-can-wait.org][CI can wait]]
- [[file:decisions/20251208184623-llms-are-my-colleagues.org][LLMs are my colleagues]]

* Tasks
** Setup                                                          :NOEXPORT:
#+begin_src emacs-lisp
(setq sql-postgres-program (executable-find "psql"))
#+end_src

#+results:
: /nix/store/19v6sifj4i7zynjb3r974yhqlx07lppm-postgresql-and-plugins-17.6/bin/psql

** Seed the database
We have a file:seeds.toml file that contains tenants and users we want to insert
immediately to speed up development.

#+begin_src sh :results output verbatim :eval query
just db-seed
#+end_src

#+property: header-args:sql  :engine postgresql
#+property: header-args:sql+ :dbhost     "localhost"
#+property: header-args:sql+ :database   "bits_dev"
#+property: header-args:sql+ :dbuser     "bits"
#+property: header-args:sql+ :dbpassword "please"
#+begin_src sql
select
  t.id,
  t.name,
  td.domain
from tenants t
join tenant_domains td on td.tenant_id = t.id;
#+end_src

#+results:
| id | name                             | domain                  |
|----+----------------------------------+-------------------------|
|  1 | Building Bits                    | jcf.bits.page.test      |
|  2 | Jimmy's Leather Emporium         | emporium.bits.page.test |
|  3 | Charlie's Countryside Adventures | charlie.bits.page.test  |
|  4 | Millie's Meat Treats             | milly.bits.page.test    |

** Truncate tables
To test empty states, one needs to truncate appropriate tables:

#+begin_src sh :results output verbatim :eval query
just psql 2>&1 <<SQL
  truncate table tenants cascade;
  truncate table sessions cascade;
SQL
#+end_src

** Verify email address
#+begin_src sh :results output verbatim :eval query
email="$(git config user.email)"

just psql 2>&1 <<SQL
  insert into email_verifications (email_address_id)
  values ((select id from email_addresses where address = '${email}'))
SQL
#+end_src

#+results:
: PGPASSWD=please psql --host=localhost --port=5432 --username=bits --dbname=bits_dev
: INSERT 0 1
: Time: 6.540 ms

* Prompts
We maintain version-controlled prompt docs that describe sessions with language
models where we plan, generate, and review functionality.

** =TODO=
#+begin_src sh :results output table :colnames '("Status" "Date" "Title") :exports results
fd --type file '\.org$' .claude/prompts | sort | while read -r file; do
  title=$(awk -F':[[:space:]]*' '/^#\+title:/ { print $2; exit }' "$file")
  status=$(awk -F':[[:space:]]*' '/^#\+status:/ { print toupper($2); exit }' "$file" | xargs)
  date=$(awk -F':[[:space:]]*' '/^#\+date:/ { print $2; exit }' "$file" | xargs)
  [[ $status = "DONE" ]] || echo -e "=$status=\t=$date=\t[[file:$file][$title]]"
done
#+end_src

#+results:
| Status | Date         | Title                          |
|--------+--------------+--------------------------------|
| =TODO= | =2025-12-04= | [[file:.claude/prompts/20251204140000-infrastructure-foundation.org][Infrastructure Foundation]]      |
| =TODO= | =2025-12-04= | [[file:.claude/prompts/20251204140400-production-deployment.org][Production Deployment]]          |
| =TODO= | =2025-12-04= | [[file:.claude/prompts/20251204182609-packer-nixos-image-for-hetzner.org][Packer NixOS Image for Hetzner]] |
| =TODO= | =2025-12-08= | [[file:.claude/prompts/20251208-pii-type-system.org][PII Type System]]                |

** =DONE=
#+begin_src sh :results output table :colnames '("Status" "Date" "Title") :exports results
fd --type file '\.org$' .claude/prompts | sort | while read -r file; do
  title=$(awk -F':[[:space:]]*' '/^#\+title:/ { print $2; exit }' "$file")
  status=$(awk -F':[[:space:]]*' '/^#\+status:/ { print toupper($2); exit }' "$file" | xargs)
  date=$(awk -F':[[:space:]]*' '/^#\+date:/ { print $2; exit }' "$file" | xargs)
  [[ $status = "DONE" ]] && echo -e "=$status=\t=$date=\t[[file:$file][$title]]"
done
#+end_src

#+results:
| Status | Date         | Title                                       |
|--------+--------------+---------------------------------------------|
| =DONE= | =2025-12-04= | [[file:.claude/prompts/20251204140100-type-system-refactoring.org][Type System Refactoring]]                     |
| =DONE= | =2025-12-04= | [[file:.claude/prompts/20251204140200-features-and-organization.org][Features and Organization]]                   |
| =DONE= | =2025-12-04= | [[file:.claude/prompts/20251204140300-landing-page-ui.org][Landing Page UI]]                             |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205120511-handle-validation-improvements.org][Handle Validation Improvements]]              |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205133111-nixos-deployment-cleanup.org][NixOS deployment cleanup]]                    |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205160800-rate-limit-authentication-endpoints.org][Rate Limit Application Endpoints]]            |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205161500-complete-email-verification-enforcement.org][Complete Email Verification Enforcement]]     |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205161600-replace-argon2-for-verification-codes.org][Replace Argon2 for Verification Codes]]       |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205174618-eliminate-boolean-parameters.org][Eliminate Boolean Parameters]]                |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205174620-introduce-domain-newtypes.org][Introduce Domain Newtypes]]                   |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205174622-remove-debug-statements.org][Remove Debug Statements]]                     |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205174624-add-critical-unit-tests.org][Add Critical Unit Tests]]                     |
| =DONE= | =2025-12-05= | [[file:.claude/prompts/20251205174626-improve-error-handling.org][Improve Error Handling]]                      |
| =DONE= | =2025-12-06= | [[file:.claude/prompts/20251206140000-refactor-bits-client.org][Refactor BitsClient]]                         |
| =DONE= | =2025-12-06= | [[file:.claude/prompts/20251206153200-add-garde-validation-library.org][Add Garde validation library]]                |
| =DONE= | =2025-12-08= | [[file:.claude/prompts/20251208121140-interactive-prompt-execution-with-fzf.org][Interactive prompt execution with fzf]]       |
| =DONE= | =2025-12-08= | [[file:.claude/prompts/20251208204054-share-auth-form-between-sign-in-and-sign-up.org][Share auth form between sign in and sign up]] |

* TODOs
#+begin_src sh :results output verbatim :exports results
rg --glob '!README.org' 'TODO|FIXME' </dev/null | sort
#+end_src

#+results:
: crates/bits-app/src/auth.rs:// TODO Use #[patch] when Dioxus next ships
: crates/bits-app/src/auth_rate_limit/types.rs:// TODO: Replace with comprehensive PII type system
: crates/bits-app/src/config.rs:// TODO Wrap u32 in 'Limit' type.
: crates/bits-app/src/pages/layout.rs:    // TODO Make csrf_token a proper type akin to Option<String>.
: crates/bits-app/src/server.rs:// TODO Add health checks to core components within `AppState`.
: devenv.nix:    # TODO Create a dedicated Bits Postmark account.

* Troubleshooting
** Dioxus version
One needs to ensure Dioxus and =dioxus-cli= remain in sync or one might
encounter errors inside of =link= tags:

#+begin_src html :eval never
<link rel="stylesheet" href="/assets/This should be replaced by dx as part of the build process. If you see this error, make sure you are using a matching version of dx and dioxus and you are not stripping symbols from your binary."></link>
#+end_src

#+begin_src sh :results output table :colnames '("Package" "Version") :exports results
echo -e "dioxus\t$(grep 'dioxus = ' Cargo.toml | grep -o '[0-9]\+\.[0-9]\+\.[0-9]\+')"
echo -e "dioxus-cli\t$(grep 'version = ' nix/overlays/dioxus-cli.nix | grep -o '[0-9]\+\.[0-9]\+\.[0-9]\+')"
echo -e "wasm-bindgen-cli\t$(grep 'version = ' nix/overlays/wasm-bindgen-cli.nix | grep -o '[0-9]\+\.[0-9]\+\.[0-9]\+')"
#+end_src

#+results:
| Package          | Version |
|------------------+---------|
| dioxus           |   0.7.1 |
| dioxus-cli       |   0.7.1 |
| wasm-bindgen-cli | 0.2.105 |
